{"class_name": "Functional", "config": {"name": "MyModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_75"}, "name": "input_75", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_104", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_104", "inbound_nodes": [[["input_75", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_42", "trainable": true, "dtype": "float32"}, "name": "multiply_42", "inbound_nodes": [[["batch_normalization_104", 0, 0, {}], ["batch_normalization_104", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_40", "trainable": true, "dtype": "float32"}, "name": "add_40", "inbound_nodes": [[["multiply_42", 0, 0, {}], ["batch_normalization_104", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_206", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_206", "inbound_nodes": [[["add_40", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_105", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_105", "inbound_nodes": [[["dense_206", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_43", "trainable": true, "dtype": "float32"}, "name": "multiply_43", "inbound_nodes": [[["batch_normalization_105", 0, 0, {}], ["batch_normalization_105", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_41", "trainable": true, "dtype": "float32"}, "name": "add_41", "inbound_nodes": [[["multiply_43", 0, 0, {}], ["batch_normalization_105", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_207", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_207", "inbound_nodes": [[["add_41", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_106", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_106", "inbound_nodes": [[["dense_207", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_208", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_208", "inbound_nodes": [[["batch_normalization_106", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_74", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_74", "inbound_nodes": [[["dense_208", 0, 0, {}]]]}], "input_layers": [["input_75", 0, 0]], "output_layers": [["activation_74", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}